tutorials/incompressible/pimpleDyMFoam/oscillatingInletACMI2D/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly false;


// Baffles to create.
baffles
{
    // NOTE: cyclicAMI patches MUST BE defined PRIOR to their associted
    //       blockage patches

    ACMI1
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    couple1Faces;

        patches
        {
            master
            {
                //- Master side patch
                name            ACMI1_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ACMI2_couple;
                nonOverlapPatch ACMI1_blockage;
                transform       noOrdering;
            }
            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI1_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ACMI1_blockage;
                type            wall;
            }
            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI1_blockage;
                type            wall;
            }

        }
    }
    ACMI2
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    couple2Faces;

        patches
        {
            master
            {
                //- Master side patch
                name            ACMI2_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ACMI1_couple;
                nonOverlapPatch ACMI2_blockage;
                transform       noOrdering;
            }
            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI2_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ACMI2_blockage;
                type            wall;
            }
            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ACMI2_blockage;
                type            wall;
            }
        }
    }
}


// ************************************************************************* //
